In [2]:
import pandas as pd
import numpy as np

In [3]:
print(pd.__version__)

2.1.1

In [4]:
list=[1,2,3,5]
pd.Series(list)

0    1
1    2
2    3
3    5
dtype: int64

In [5]:
Names=['Ravi','Jiva','Linda','Loha']
pd.Series(Names,index=["a","b","c","d"])

a     Ravi
b     Jiva
c    Linda
d     Loha
dtype: object

In [6]:
Student_mks={"Ravi":172,"Goata":230,"Tota":345}
pd.Series(Student_mks)

Ravi     172
Goata    230
Tota     345
dtype: int64

In [7]:
arr=np.arange(2,6)
print(arr)
pd.Series(arr)

[2 3 4 5]

0    2
1    3
2    4
3    5
dtype: int32

In [8]:
print(pd.__version__)
df=pd.DataFrame()
print(df)

2.1.1
Empty DataFrame
Columns: []
Index: []

In [9]:
countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

In [10]:
df=pd.DataFrame(countries)
df

     Name  Codes
0     USA      1
1   India     91
2  German     49
3  Rwanda    250

In [11]:
array = np.array ([[1,2,3], [4,5,6], [7,8,9]])

print(pd.DataFrame(array))

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:

pd.DataFrame(array, columns = ['column 1', 'column 2', 'column 3'])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [13]:
Student_mks={"Ravi":172,"Goata":230,"Tota":345}
result=pd.Series(Student_mks)
df=pd.DataFrame(result,columns=['Marks'])
print(df)

       Marks
Ravi     172
Goata    230
Tota     345

In [14]:
df['Gender']=['Male','TransGender','Gay']
print(df)

       Marks       Gender
Ravi     172         Male
Goata    230  TransGender
Tota     345          Gay

In [15]:
#remove Gender columns
df.drop('Gender',axis=1)

       Marks
Ravi     172
Goata    230
Tota     345

In [16]:
df.columns

Index(['Marks', 'Gender'], dtype='object')

In [17]:
df.keys

<bound method NDFrame.keys of        Marks       Gender
Ravi     172         Male
Goata    230  TransGender
Tota     345          Gay>

In [18]:
df.index

Index(['Ravi', 'Goata', 'Tota'], dtype='object')

### Data Indexing and Selection in Both Series and Pandas

In [19]:
Student_mks={"Ravi":[172,290,432],"Goata":[230,345,233],"Tota":[345,245,324]}
df=pd.DataFrame(Student_mks,index=['Maths','Physics','English'])
df

         Ravi  Goata  Tota
Maths     172    230   345
Physics   290    345   245
English   432    233   324

In [20]:
df['Ravi']

Maths      172
Physics    290
English    432
Name: Ravi, dtype: int64

In [21]:
df.Ravi

Maths      172
Physics    290
English    432
Name: Ravi, dtype: int64

In [22]:
df[['Ravi','Tota']]

         Ravi  Tota
Maths     172   345
Physics   290   245
English   432   324

In [23]:
df [0:2]#First two rows of table

         Ravi  Goata  Tota
Maths     172    230   345
Physics   290    345   245

In [24]:
df.loc['Maths']

Ravi     172
Goata    230
Tota     345
Name: Maths, dtype: int64

In [25]:
df.iloc[1:3]

         Ravi  Goata  Tota
Physics   290    345   245
English   432    233   324

In [26]:
df.iloc[2:]

         Ravi  Goata  Tota
English   432    233   324

In [27]:
df

         Ravi  Goata  Tota
Maths     172    230   345
Physics   290    345   245
English   432    233   324

In [28]:
df[df['Ravi']==290]

         Ravi  Goata  Tota
Physics   290    345   245

In [29]:
df[df['Ravi']>200]

         Ravi  Goata  Tota
Physics   290    345   245
English   432    233   324

In [30]:
list=[432,878,958,290,897,445]
df.isin(list)

          Ravi  Goata   Tota
Maths    False  False  False
Physics   True  False  False
English   True  False  False

In [31]:
df2=pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),columns=['Fisrt','Second','Third'])
df2

   Fisrt  Second  Third
0      1       2      3
1      4       5      6
2      7       8      9

In [32]:
for col_name,content in df2.items():
    print(col_name)
    print(content)

Fisrt
0    1
1    4
2    7
Name: Fisrt, dtype: int32
Second
0    2
1    5
2    8
Name: Second, dtype: int32
Third
0    3
1    6
2    9
Name: Third, dtype: int32

In [33]:
for row in df2.iterrows():
    print(row)

(0, Fisrt     1
Second    2
Third     3
Name: 0, dtype: int32)
(1, Fisrt     4
Second    5
Third     6
Name: 1, dtype: int32)
(2, Fisrt     7
Second    8
Third     9
Name: 2, dtype: int32)

In [34]:
for row in df2.itertuples():
    print(row)

Pandas(Index=0, Fisrt=1, Second=2, Third=3)
Pandas(Index=1, Fisrt=4, Second=5, Third=6)
Pandas(Index=2, Fisrt=7, Second=8, Third=9)

In [35]:
df3 = pd.DataFrame(np.array ([[11,12,13], [14,np.nan,16], [71,np.nan,np.nan]]), 
                   columns = ['C1', 'C2', 'C3'])
df3

     C1    C2    C3
0  11.0  12.0  13.0
1  14.0   NaN  16.0
2  71.0   NaN   NaN

In [36]:
df3.isnull()

      C1     C2     C3
0  False  False  False
1  False   True  False
2  False   True   True

In [37]:
df3.isnull().sum()#number of null place in table of data Frame

C1    0
C2    2
C3    1
dtype: int64

In [38]:
df3.notna()

     C1     C2     C3
0  True   True   True
1  True  False   True
2  True  False  False

In [39]:
df3.notna().sum()

C1    3
C2    1
C3    2
dtype: int64

In [40]:
df3.dropna()

     C1    C2    C3
0  11.0  12.0  13.0

In [41]:

df3.dropna(axis=1)

     C1
0  11.0
1  14.0
2  71.0

In [42]:

df3.dropna(axis=0)

     C1    C2    C3
0  11.0  12.0  13.0

In [43]:
df3.fillna(-1)

     C1    C2    C3
0  11.0  12.0  13.0
1  14.0  -1.0  16.0
2  71.0  -1.0  -1.0

In [44]:

df3.fillna('LOvera Sur')

     C1          C2          C3
0  11.0        12.0        13.0
1  14.0  LOvera Sur        16.0
2  71.0  LOvera Sur  LOvera Sur

In [45]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag'], 
              'Order Number':[56,67,68], 
              'Total Quantity':[14,25,29]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])
df4

  Product Name  Order Number  Total Quantity
0        Shirt            56              14
1         Boot            67              25
2          Bag            68              29

In [46]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    3 non-null      object
 1   Order Number    3 non-null      int64
 2   Total Quantity  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [47]:
df4.columns

Index(['Product Name', 'Order Number', 'Total Quantity'], dtype='object')

In [48]:
df4.keys

<bound method NDFrame.keys of   Product Name  Order Number  Total Quantity
0        Shirt            56              14
1         Boot            67              25
2          Bag            68              29>

In [49]:
df4.head(1)

  Product Name  Order Number  Total Quantity
0        Shirt            56              14

In [50]:
df4.tail(1)

  Product Name  Order Number  Total Quantity
2          Bag            68              29

In [51]:
df4.values

array([['Shirt', 56, 14],
       ['Boot', 67, 25],
       ['Bag', 68, 29]], dtype=object)

In [52]:
df4.size

9

In [53]:
df4.shape

(3, 3)

In [54]:

df4['Product Name'].unique()

array(['Shirt', 'Boot', 'Bag'], dtype=object)

In [55]:
df4['Product Name'].nunique()

3

In [56]:
df4['Product Name'].value_counts()

Product Name
Shirt    1
Boot     1
Bag      1
Name: count, dtype: int64

In [57]:
df4.describe()

       Order Number  Total Quantity
count      3.000000        3.000000
mean      63.666667       22.666667
std        6.658328        7.767453
min       56.000000       14.000000
25%       61.500000       19.500000
50%       67.000000       25.000000
75%       67.500000       27.000000
max       68.000000       29.000000

In [58]:
df4.describe().transpose()

                count       mean       std   min   25%   50%   75%   max
Order Number      3.0  63.666667  6.658328  56.0  61.5  67.0  67.5  68.0
Total Quantity    3.0  22.666667  7.767453  14.0  19.5  25.0  27.0  29.0

In [59]:
df4['Total Quantity'].mode()

0    14
1    25
2    29
Name: Total Quantity, dtype: int64

In [60]:
df4['Total Quantity'].max()

29

In [61]:
df4['Total Quantity'].min()

14

In [62]:
df4['Total Quantity'].mean()

22.666666666666668

In [63]:

df4['Total Quantity'].median()

25.0

In [64]:
df4['Total Quantity'].std()

7.767453465154029

In [65]:
df4['Total Quantity'].var()

60.33333333333333

In [66]:
df4['Total Quantity'].sum()

68

In [67]:
df4['Total Quantity'].prod()#Product of all

10150

In [68]:
df4=pd.DataFrame({'Student Id':[101,102,103,104,105],'Student Name':['Raju','Kaju','Padu','Jadu','Saku'],'Student Marks(100)':[78,80,77,65,91]},columns=['Student Id','Student Name','Student Marks(100)'])
df4

   Student Id Student Name  Student Marks(100)
0         101         Raju                  78
1         102         Kaju                  80
2         103         Padu                  77
3         104         Jadu                  65
4         105         Saku                  91

In [69]:
#Group the df4 by 'Student Detail
df4.groupby('Student Name').mean()#If there was redundancy then there mean will get calculated

              Student Id  Student Marks(100)
Student Name
Jadu               104.0                65.0
Kaju               102.0                80.0
Padu               103.0                77.0
Raju               101.0                78.0
Saku               105.0                91.0

In [70]:
df4.groupby('Student Id').sum()#Add the redundancy value

           Student Name  Student Marks(100)
Student Id
101                Raju                  78
102                Kaju                  80
103                Padu                  77
104                Jadu                  65
105                Saku                  91

In [71]:
df4.groupby('Student Name').min()#Get min one

              Student Id  Student Marks(100)
Student Name
Jadu                 104                  65
Kaju                 102                  80
Padu                 103                  77
Raju                 101                  78
Saku                 105                  91

In [72]:
df4.groupby('Student Name').max()

              Student Id  Student Marks(100)
Student Name
Jadu                 104                  65
Kaju                 102                  80
Padu                 103                  77
Raju                 101                  78
Saku                 105                  91

In [73]:
df4.groupby(['Student Id','Student Name']).max()

                         Student Marks(100)
Student Id Student Name
101        Raju                          78
102        Kaju                          80
103        Padu                          77
104        Jadu                          65
105        Saku                          91

In [74]:
#Shopping Table of Clothes
df5=pd.DataFrame({'Product Name':['Shirt','Pant','TShirt','TShirt','Pant','Boot','Towel','Short','Shirt','Boot'],'Price':[400,490,499,699,790,800,1000,1299,500,1199],'Quantity':[23,67,23,56,13,45,56,67,8,98]},columns=['Product Name','Price','Quantity'])
df5

  Product Name  Price  Quantity
0        Shirt    400        23
1         Pant    490        67
2       TShirt    499        23
3       TShirt    699        56
4         Pant    790        13
5         Boot    800        45
6        Towel   1000        56
7        Short   1299        67
8        Shirt    500         8
9         Boot   1199        98

In [75]:
df5.groupby('Product Name')

In [76]:
df5.groupby('Product Name').mean()

               Price  Quantity
Product Name
Boot           999.5      71.5
Pant           640.0      40.0
Shirt          450.0      15.5
Short         1299.0      67.0
TShirt         599.0      39.5
Towel         1000.0      56.0

In [77]:
df5.groupby('Product Name').max()

              Price  Quantity
Product Name
Boot           1199        98
Pant            790        67
Shirt           500        23
Short          1299        67
TShirt          699        56
Towel          1000        56

In [78]:
df5.groupby('Product Name').min()

              Price  Quantity
Product Name
Boot            800        45
Pant            490        13
Shirt           400         8
Short          1299        67
TShirt          499        23
Towel          1000        56

In [79]:
df5.groupby('Product Name').sum()

              Price  Quantity
Product Name
Boot           1999       143
Pant           1280        80
Shirt           900        31
Short          1299        67
TShirt         1198        79
Towel          1000        56

In [80]:
df5.groupby(['Product Name','Price']).max()

                    Quantity
Product Name Price
Boot         800          45
             1199         98
Pant         490          67
             790          13
Shirt        400          23
             500           8
Short        1299         67
TShirt       499          23
             699          56
Towel        1000         56

In [81]:
df5.groupby(['Product Name','Price']).min()

                    Quantity
Product Name Price
Boot         800          45
             1199         98
Pant         490          67
             790          13
Shirt        400          23
             500           8
Short        1299         67
TShirt       499          23
             699          56
Towel        1000         56

In [82]:
df5.groupby(['Product Name','Price']).sum()

                    Quantity
Product Name Price
Boot         800          45
             1199         98
Pant         490          67
             790          13
Shirt        400          23
             500           8
Short        1299         67
TShirt       499          23
             699          56
Towel        1000         56

In [83]:
#Now aggregation after groupby
df5.groupby('Product Name').aggregate(['min','max','sum'])

             Price             Quantity
               min   max   sum      min max  sum
Product Name
Boot           800  1199  1999       45  98  143
Pant           490   790  1280       13  67   80
Shirt          400   500   900        8  23   31
Short         1299  1299  1299       67  67   67
TShirt         499   699  1198       23  56   79
Towel         1000  1000  1000       56  56   56

### Concatenating Joining and Merging

In [84]:
df1=pd.DataFrame({'Column1':['A','B','C','D'],'Column2':[1,2,3,4]},index=['a','b','c','d'])

df2=pd.DataFrame({'Column1':['E','F','G','H'],'Column2':[5,6,7,8]},index=['e','f','g','h'])

df3=pd.DataFrame({'Column1':['I','J','K','L'],'Column2':[9,10,11,12]},index=['i','j','k','l'])

In [85]:
print(df1,'\n\n',df2,'\n\n',df3)

  Column1  Column2
a       A        1
b       B        2
c       C        3
d       D        4

   Column1  Column2
e       E        5
f       F        6
g       G        7
h       H        8

   Column1  Column2
i       I        9
j       J       10
k       K       11
l       L       12

In [86]:
pd.concat([df1,df2,df3])

  Column1  Column2
a       A        1
b       B        2
c       C        3
d       D        4
e       E        5
f       F        6
g       G        7
h       H        8
i       I        9
j       J       10
k       K       11
l       L       12

In [87]:
pd.concat([df1,df2,df3],axis=1)

  Column1  Column2 Column1  Column2 Column1  Column2
a       A      1.0     NaN      NaN     NaN      NaN
b       B      2.0     NaN      NaN     NaN      NaN
c       C      3.0     NaN      NaN     NaN      NaN
d       D      4.0     NaN      NaN     NaN      NaN
e     NaN      NaN       E      5.0     NaN      NaN
f     NaN      NaN       F      6.0     NaN      NaN
g     NaN      NaN       G      7.0     NaN      NaN
h     NaN      NaN       H      8.0     NaN      NaN
i     NaN      NaN     NaN      NaN       I      9.0
j     NaN      NaN     NaN      NaN       J     10.0
k     NaN      NaN     NaN      NaN       K     11.0
l     NaN      NaN     NaN      NaN       L     12.0

In [88]:
#Merging
df1=pd.DataFrame({'Name':['Monkey','Donkey','Lion','Cat'],'Role':['Fart','Dumbness','Roaring','Nothing']})

df2=pd.DataFrame({'Name':['Monkey','Donkey','Lion','Cat'],'Year of Work':[2019,2017,2020,2017]})

df3=pd.DataFrame({'Name':['Monkey','Donkey','Lion','Cat'],'Kill':[23,3,4000,34]})

In [89]:
print(df1,'\n\n',df2,'\n\n',df3)

     Name      Role
0  Monkey      Fart
1  Donkey  Dumbness
2    Lion   Roaring
3     Cat   Nothing

      Name  Year of Work
0  Monkey          2019
1  Donkey          2017
2    Lion          2020
3     Cat          2017

      Name  Kill
0  Monkey    23
1  Donkey     3
2    Lion  4000
3     Cat    34

In [90]:
df2

     Name  Year of Work
0  Monkey          2019
1  Donkey          2017
2    Lion          2020
3     Cat          2017

In [91]:
pd.merge(df1,df2)

     Name      Role  Year of Work
0  Monkey      Fart          2019
1  Donkey  Dumbness          2017
2    Lion   Roaring          2020
3     Cat   Nothing          2017

In [92]:
pd.merge(df1,df2,how='inner',on='Name')

     Name      Role  Year of Work
0  Monkey      Fart          2019
1  Donkey  Dumbness          2017
2    Lion   Roaring          2020
3     Cat   Nothing          2017

In [93]:
df1 = pd.DataFrame({'col1': ['K0', 'K0', 'K1', 'K2'],
                     'col2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'col1': ['K0', 'K1', 'K1', 'K2'],
                               'col2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [94]:
df1

  col1 col2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [95]:
df2

  col1 col2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [96]:
pd.merge(df1,df2,how='inner',on=['col1','col2'])

  col1 col2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [97]:
pd.merge(df1, df2, how='outer', on=['col1', 'col2'])

  col1 col2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [98]:
pd.merge(df1, df2, how='left')

  col1 col2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [99]:
pd.merge(df1, df2, how='right')

  col1 col2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Joining

In [100]:
df1 = pd.DataFrame({'Col1': ['A', 'B', 'C'],
                     'Col2': [11, 12, 13]},
                      index=['a', 'b', 'c']) 

df2 = pd.DataFrame({'Col3': ['D', 'E', 'F'],
                    'Col4': [14, 14, 16]},
                      index=['a', 'c', 'd'])

In [101]:
df1

  Col1  Col2
a    A    11
b    B    12
c    C    13

In [102]:
df2

  Col3  Col4
a    D    14
c    E    14
d    F    16

In [103]:
df1.join(df2)

  Col1  Col2 Col3  Col4
a    A    11    D  14.0
b    B    12  NaN   NaN
c    C    13    E  14.0

In [104]:
df2.join(df1)

  Col3  Col4 Col1  Col2
a    D    14    A  11.0
c    E    14    C  13.0
d    F    16  NaN   NaN

In [105]:
df1.join(df2, how='inner')

  Col1  Col2 Col3  Col4
a    A    11    D    14
c    C    13    E    14

In [106]:
df1.join(df2, how='outer')

  Col1  Col2 Col3  Col4
a    A  11.0    D  14.0
b    B  12.0  NaN   NaN
c    C  13.0    E  14.0
d  NaN   NaN    F  16.0

## CSV and Excel

In [107]:
data=pd.read_csv('housing.csv')

In [108]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [109]:
type(data)

pandas.core.frame.DataFrame

In [110]:
data.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [111]:

data.to_csv('housing_dataset', index=False)

In [ ]:
data.to_excel('housing_excel.xlsx', index=False)

In [ ]:
excel_data = pd.read_excel('housing_excel.xlsx')

## Explore Data

In [132]:
wine_data=pd.read_csv('winequality-red.csv')

In [133]:
print(wine_data)

      fixed acidity  volatile acidity  citric acid  residual sugar  chlorides  \
0               7.4             0.700         0.00             1.9      0.076
1               7.8             0.880         0.00             2.6      0.098
2               7.8             0.760         0.04             2.3      0.092
3              11.2             0.280         0.56             1.9      0.075
4               7.4             0.700         0.00             1.9      0.076
...             ...               ...          ...             ...        ...
1594            6.2             0.600         0.08             2.0      0.090
1595            5.9             0.550         0.10             2.2      0.062
1596            6.3             0.510         0.13             2.3      0.076
1597            5.9             0.645         0.12             2.0      0.075
1598            6.0             0.310         0.47             3.6      0.067

      free sulfur dioxide  total sulfur dioxide  density    pH  sulphates  \
0                    11.0                  34.0  0.99780  3.51       0.56
1                    25.0                  67.0  0.99680  3.20       0.68
2                    15.0                  54.0  0.99700  3.26       0.65
3                    17.0                  60.0  0.99800  3.16       0.58
4                    11.0                  34.0  0.99780  3.51       0.56
...                   ...                   ...      ...   ...        ...
1594                 32.0                  44.0  0.99490  3.45       0.58
1595                 39.0                  51.0  0.99512  3.52       0.76
1596                 29.0                  40.0  0.99574  3.42       0.75
1597                 32.0                  44.0  0.99547  3.57       0.71
1598                 18.0                  42.0  0.99549  3.39       0.66

      alcohol  quality
0         9.4        5
1         9.8        5
2         9.8        5
3         9.8        6
4         9.4        5
...       ...      ...
1594     10.5        5
1595     11.2        6
1596     11.0        6
1597     10.2        5
1598     11.0        6

[1599 rows x 12 columns]

In [134]:
wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [135]:
wine_data.tail()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [136]:
wine_data.describe()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
count,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000
mean,8.319637,0.527821,0.270976,2.538806,0.087467,15.874922,46.467792,0.996747,3.311113,0.658149,10.422983,5.636023
std,1.741096,0.179060,0.194801,1.409928,0.047065,10.460157,32.895324,0.001887,0.154386,0.169507,1.065668,0.807569
min,4.600000,0.120000,0.000000,0.900000,0.012000,1.000000,6.000000,0.990070,2.740000,0.330000,8.400000,3.000000
25%,7.100000,0.390000,0.090000,1.900000,0.070000,7.000000,22.000000,0.995600,3.210000,0.550000,9.500000,5.000000
50%,7.900000,0.520000,0.260000,2.200000,0.079000,14.000000,38.000000,0.996750,3.310000,0.620000,10.200000,6.000000
75%,9.200000,0.640000,0.420000,2.600000,0.090000,21.000000,62.000000,0.997835,3.400000,0.730000,11.100000,6.000000
max,15.900000,1.580000,1.000000,15.500000,0.611000,72.000000,289.000000,1.003690,4.010000,2.000000,14.900000,8.000000

In [137]:
wine_data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
fixed acidity,1599.0,8.319637,1.741096,4.60000,7.1000,7.90000,9.200000,15.90000
volatile acidity,1599.0,0.527821,0.179060,0.12000,0.3900,0.52000,0.640000,1.58000
citric acid,1599.0,0.270976,0.194801,0.00000,0.0900,0.26000,0.420000,1.00000
residual sugar,1599.0,2.538806,1.409928,0.90000,1.9000,2.20000,2.600000,15.50000
chlorides,1599.0,0.087467,0.047065,0.01200,0.0700,0.07900,0.090000,0.61100
free sulfur dioxide,1599.0,15.874922,10.460157,1.00000,7.0000,14.00000,21.000000,72.00000
total sulfur dioxide,1599.0,46.467792,32.895324,6.00000,22.0000,38.00000,62.000000,289.00000
density,1599.0,0.996747,0.001887,0.99007,0.9956,0.99675,0.997835,1.00369
pH,1599.0,3.311113,0.154386,2.74000,3.2100,3.31000,3.400000,4.01000
sulphates,1599.0,0.658149,0.169507,0.33000,0.5500,0.62000,0.730000,2.00000
alcohol,1599.0,10.422983,1.065668,8.40000,9.5000,10.20000,11.100000,14.90000
quality,1599.0,5.636023,0.807569,3.00000,5.0000,6.00000,6.000000,8.00000

In [138]:
wine_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1599 non-null   float64
 1   volatile acidity      1599 non-null   float64
 2   citric acid           1599 non-null   float64
 3   residual sugar        1599 non-null   float64
 4   chlorides             1599 non-null   float64
 5   free sulfur dioxide   1599 non-null   float64
 6   total sulfur dioxide  1599 non-null   float64
 7   density               1599 non-null   float64
 8   pH                    1599 non-null   float64
 9   sulphates             1599 non-null   float64
 10  alcohol               1599 non-null   float64
 11  quality               1599 non-null   int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [139]:
wine_data.isnull().sum()

fixed acidity           0
volatile acidity        0
citric acid             0
residual sugar          0
chlorides               0
free sulfur dioxide     0
total sulfur dioxide    0
density                 0
pH                      0
sulphates               0
alcohol                 0
quality                 0
dtype: int64

In [141]:
wine_data['quality'].value_counts()#Quality range from 0 t0 10 higher the quality the good wine in taste

quality
5    681
6    638
7    199
4     53
8     18
3     10
Name: count, dtype: int64

In [143]:
wine_data.groupby(['fixed acidity','volatile acidity','citric acid']).sum()#acid nature check

                                            residual sugar  chlorides  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                    2.1      0.054
4.7           0.600            0.17                    2.3      0.058
4.9           0.420            0.00                    2.1      0.048
5.0           0.380            0.01                    1.6      0.048
              0.400            0.50                    4.3      0.046
...                                                    ...        ...
15.0          0.210            0.44                    4.4      0.150
15.5          0.645            0.49                    8.4      0.190
15.6          0.645            0.49                    4.2      0.095
              0.685            0.76                    3.7      0.100
15.9          0.360            0.65                    7.5      0.096

                                            free sulfur dioxide  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         8.0
4.7           0.600            0.17                        17.0
4.9           0.420            0.00                        16.0
5.0           0.380            0.01                        26.0
              0.400            0.50                        29.0
...                                                         ...
15.0          0.210            0.44                        20.0
15.5          0.645            0.49                        20.0
15.6          0.645            0.49                        10.0
              0.685            0.76                         6.0
15.9          0.360            0.65                        22.0

                                            total sulfur dioxide  density  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         65.0  0.99340
4.7           0.600            0.17                        106.0  0.99320
4.9           0.420            0.00                         42.0  0.99154
5.0           0.380            0.01                         60.0  0.99084
              0.400            0.50                         80.0  0.99020
...                                                          ...      ...
15.0          0.210            0.44                         48.0  2.00010
15.5          0.645            0.49                         46.0  2.00630
15.6          0.645            0.49                         23.0  1.00315
              0.685            0.76                         43.0  1.00320
15.9          0.360            0.65                         71.0  0.99760

                                              pH  sulphates  alcohol  quality
fixed acidity volatile acidity citric acid
4.6           0.520            0.15         3.90       0.56     13.1        4
4.7           0.600            0.17         3.85       0.60     12.9        6
4.9           0.420            0.00         3.71       0.74     14.0        7
5.0           0.380            0.01         3.70       0.75     14.0        6
              0.400            0.50         3.49       0.66     13.6        6
...                                          ...        ...      ...      ...
15.0          0.210            0.44         6.14       1.68     18.4       14
15.5          0.645            0.49         5.84       1.48     22.2       10
15.6          0.645            0.49         2.92       0.74     11.1        5
              0.685            0.76         2.95       0.68     11.2        7
15.9          0.360            0.65         2.98       0.84     14.9        5

[1333 rows x 9 columns]

In [144]:
wine_data.groupby(['free sulfur dioxide','total sulfur dioxide']).sum()#sulfur content grouping

                                          fixed acidity  volatile acidity  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                           18.2             0.440
                    44.0                            7.9             0.400
2.0                 45.0                            7.9             0.400
3.0                 6.0                            33.0             1.215
                    7.0                            25.8             1.520
...                                                 ...               ...
55.0                95.0                           20.4             1.080
57.0                135.0                           5.9             0.190
66.0                115.0                           6.9             0.630
68.0                124.0                          13.2             1.470
72.0                160.0                           5.9             0.290

                                          citric acid  residual sugar  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                         0.48             4.2
                    44.0                         0.29             1.8
2.0                 45.0                         0.30             1.8
3.0                 6.0                          1.38             5.0
                    7.0                          0.63             6.0
...                                               ...             ...
55.0                95.0                         0.74            30.8
57.0                135.0                        0.21             1.7
66.0                115.0                        0.33             6.7
68.0                124.0                        0.04            15.8
72.0                160.0                        0.25            13.4

                                          chlorides  density    pH  sulphates  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                      0.156  1.99800  6.82       1.74
                    44.0                      0.157  0.99730  3.30       0.92
2.0                 45.0                      0.157  0.99727  3.31       0.91
3.0                 6.0                       0.229  2.98892  9.53       1.93
                    7.0                       0.242  2.98210  9.63       1.50
...                                             ...      ...   ...        ...
55.0                95.0                      0.428  2.00738  6.36       1.54
57.0                135.0                     0.045  0.99341  3.32       0.44
66.0                115.0                     0.235  0.99787  3.22       0.56
68.0                124.0                     0.244  1.99880  6.94       1.06
72.0                160.0                     0.067  0.99721  3.33       0.54

                                          alcohol  quality
free sulfur dioxide total sulfur dioxide
1.0                 28.0                     20.6       12
                    44.0                      9.5        6
2.0                 45.0                      9.5        6
3.0                 6.0                      32.7       16
                    7.0                      35.6       18
...                                           ...      ...
55.0                95.0                     18.0       12
57.0                135.0                     9.5        5
66.0                115.0                     9.5        5
68.0                124.0                    19.8       10
72.0                160.0                    10.3        6

[870 rows x 10 columns]